
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        2 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                                     |
|:--------:|:--------------------------------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook` |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_lambda_permission.allow_eventbridge`                   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.actions-runner-noble.module.deregistration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "actions-runner-20250505203133193000000009-KWX4No_deregistration"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:us-west-1:303467602807:rule/actions-runner-2025050520313319300000020250513013546426100000001"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "actions-runner-20250505203133193000000009-KWX4No_deregistration"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:us-west-1:303467602807:rule/actions-runner-2025050520313319300000020250505203154206300000023"
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==
```
</details>